-- Защита ЛР2, задание 1: текст запроса варианта и сводная таблица - его результат
-- Запуск: ./help zas 20 1 ["поставщик1" "поставщик2"]   ./help zas 22 1 [категория]
-- Пример: ./help zas 20 1 "ООО Турман" "ЧП Загорье"     ./help zas 22 1 мебель
\set QUIET on
\ir config.sql
\echo '=============================================================================='
\if :is_v20
\echo 'ВАРИАНТ 20. ЗАДАНИЕ 1. Суммарная выручка от продажи товаров двух поставщиков'
\else
\echo 'ВАРИАНТ 22. ЗАДАНИЕ 1. Суммарная выручка от продажи товаров заданной категории'
\endif
\echo '=============================================================================='
\ir show_query.sql
\echo 'Результат:'
:q ;
